
# Custom YOLOv8n + YOLOv11n backbone

nc: 3

scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C3k2, [128, True, 0.25]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C3k2, [256, True, 0.33]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C3k2, [512, True, 0.33]]

  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C3k2, [1024, True, 0.33]]

  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]
